In [1]:
num = [10, 25, 8, 30, 15]

print("최댓값 : ", max(num))

최댓값 :  30

In [2]:
print("최솟값 : ", min(num))

최솟값 :  8

In [3]:
avg = sum(num) / 5 
avg = sum(num) / len(num) 
print("평균 : ", avg)

평균 :  17.6

In [4]:
def calculate_average(scores):
    avg = round(sum(scores) / len(scores), 2) 

    if avg >= 90: 
        grade =  "A" 
    elif avg >= 80: 
        grade = "B" 
    elif avg >= 70: 
        grade = "C" 
    elif avg >= 60: 
        grade = "D" 
    else: 
        grade = "F" 

    return avg, grade

In [5]:
name = "김철수"
avg, grade = calculate_average([85, 90, 88])
print(avg) 
print(grade)

87.67
B

In [8]:
import pandas as pd
books = {
    "도서명" : ["데이터분석", "알고리즘", "자바입문", "웹개발", "파이썬"], 
    "재고" : [12, 20, 8, 3, 15], 
    "가격": [35000, 32000, 30000, 28000, 25000]
}

df = pd.DataFrame(books)
df

     도서명  재고     가격
0  데이터분석  12  35000
1   알고리즘  20  32000
2   자바입문   8  30000
3    웹개발   3  28000
4    파이썬  15  25000

In [10]:
df.isnull().sum()

도서명    0
재고     0
가격     0
dtype: int64

In [13]:
df = df.sort_values("가격", ascending=False)

In [15]:
df["할인가격"] = (df["가격"] * (1 - 0.1)).astype(int)
df

     도서명  재고     가격   할인가격
0  데이터분석  12  35000  31500
1   알고리즘  20  32000  28800
2   자바입문   8  30000  27000
3    웹개발   3  28000  25200
4    파이썬  15  25000  22500

In [16]:
df.to_csv("books_data.csv", index=False)

In [17]:

menu = {
    "메뉴명": ["아메리카노", "카페라떼", "카푸치노", "바닐라라떼", "콜드브루"],
    "판매수량": [120, 95, 60, 80, 50],
    "가격": [4500, 5000, 5000, 5500, 6000]
}

df = pd.DataFrame(menu)
df

     메뉴명  판매수량    가격
0  아메리카노   120  4500
1   카페라떼    95  5000
2   카푸치노    60  5000
3  바닐라라떼    80  5500
4   콜드브루    50  6000

In [19]:
df.iloc[2, 2]
df.loc[2, "가격"]

np.int64(5000)

In [20]:
menu = ["아메리카노", "카페라떼", "카푸치노"]
menu.append("바닐라라떼")

In [21]:
menu

['아메리카노', '카페라떼', '카푸치노', '바닐라라떼']